# Basics of Data Frame

In [1]:
# Exp: 3

In [ ]:
# Aim : Basics of Data Frame

In [27]:
# Name : Om Suresh Gujar
# Roll.No : 20
# sec : B
# Subject : ET1

In [5]:
# Basic of Data Frame

# Creating a series

In [6]:
# importing the basic library
import pandas as pd

In [7]:
# Creating Student Name List
Name=["Sahil","Jay","Rushi","Ajay","Sham",]

In [8]:
Name

['Sahil', 'Jay', 'Rushi', 'Ajay', 'Sham']

In [9]:
Rolllist=pd.Series(Name,index=[1,2,3,4,5])

In [10]:
print(Rolllist)

1    Sahil
2      Jay
3    Rushi
4     Ajay
5     Sham
dtype: object

# Creating a Data Frame

In [11]:
df=pd.DataFrame([[10,11,12,13],[11,13,17,25],[15,18,12,19],[20,27,26,13]],
columns=["CD","DBMS","DSS","CAO"])

In [12]:
df

   CD  DBMS  DSS  CAO
0  10    11   12   13
1  11    13   17   25
2  15    18   12   19
3  20    27   26   13

In [13]:
df.shape

(4, 4)

In [14]:
df.size

16

In [15]:
df.ndim

2

In [16]:
df2=pd.DataFrame([[9,12,10,11]],
columns=["CD","DBMS","DSS","CAO"])

In [17]:
df3 = pd.concat([df, df2], ignore_index=True)

In [18]:
df3

   CD  DBMS  DSS  CAO
0  10    11   12   13
1  11    13   17   25
2  15    18   12   19
3  20    27   26   13
4   9    12   10   11

# Adding Records (Columns) From Data Frame

In [19]:
df3["DM"]=[12,12,13,14,15]

In [20]:
df3

   CD  DBMS  DSS  CAO  DM
0  10    11   12   13  12
1  11    13   17   25  12
2  15    18   12   19  13
3  20    27   26   13  14
4   9    12   10   11  15

# Deleting Record (Row) From Data Frame

In [21]:
df4=df3.drop(index=[1])

In [22]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    11   12   13  12
2  15    18   12   19  13
3  20    27   26   13  14
4   9    12   10   11  15

In [23]:
print("Mean of  DSS:",df4["DSS"].mean())

Mean of  DSS: 15.0

In [24]:
df4

   CD  DBMS  DSS  CAO  DM
0  10    11   12   13  12
2  15    18   12   19  13
3  20    27   26   13  14
4   9    12   10   11  15

In [25]:
print("Mean of  DSS:",df4["DSS"].median())

Mean of  DSS: 12.0

In [26]:
print("Mean of  DSS:",df4["DSS"].mode())

Mean of  DSS: 0    12
Name: DSS, dtype: int64